#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.application.module.parameters.random_password.db_password: Refreshing state... [id=none]
module.application.module.parameters.aws_ssm_parameter.database_listenport: Refreshing state... [id=/servian/production/LISTENPORT]
module.application.module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0af257394eb0766a1]
module.application.module.parameters.aws_ssm_parameter.database_username: Refreshing state... [id=/servian/production/DBUSER]
module.application.module.parameters.aws_ssm_parameter.database_password: Refreshing state... [id=/servian/production/DBPASSWORD]
module.application.module.parameters.aws_ssm_parameter.database_name: Refreshing state... [id=/servian/production/DBNAME]
module.application.module.parameters.aws_ssm_parameter.database_listenhost: Refreshing state... [id=/servian/production/LISTENHOST]
module.application.module.parameters.aws_ssm_parameter.database_type: Refreshing state... [id=/servian/production/DBTYPE]
module.application.module.parameters.aws_ssm_parameter.database_port: Refreshing state... [id=/servian/production/DBPORT]
module.application.module.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-05b139cd2cac60055]
module.application.module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0df63a54dea2aa932]
module.application.module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f205bfc02eefed4f]
module.application.module.network.module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0be82e63d12ad97e1]
module.application.module.network.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-00cdbf90d400597c5]
module.application.module.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09bcc250db5136108]
module.application.module.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cfb3ca8eaf79fe7a]
module.application.module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-034c8eeef7cfd8b01]
module.application.module.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a24eaed5459dbf0e]
module.application.module.network.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-047fc987919d2ac4d]
module.application.module.network.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0054b9b000cf8c5c4]
module.application.module.network.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0079e4deee7295799]
module.application.module.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-029b8007bf0cad0a3]
module.application.module.network.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a2e54fa3ef5de814]
module.application.module.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05617fb15953e3c7e]
module.application.module.network.module.vpc.aws_route.database_internet_gateway[0]: Refreshing state... [id=r-rtb-0be82e63d12ad97e11080289494]
module.application.module.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cfb3ca8eaf79fe7a1080289494]
module.application.module.network.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-080eac46fcc6fc449]
module.application.module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04042ab706f9d38b2]
module.application.module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06c78a872f3b445fd]
module.application.module.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=servian-production-vpc]
module.application.module.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-04fbc3a3387e21a29]
module.application.module.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0173c8b3431e45954]
module.application.module.network.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0e639fd55e67363c6]
module.application.module.network.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0148fd174c48ee273]
module.application.module.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01396567e7cc58293]
module.application.module.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0eb395627c00807ce]
module.application.module.database.aws_security_group.db: Refreshing state... [id=sg-008df8d339ce70ddd]
module.application.module.database.module.database.module.db_instance.data.aws_partition.current: Reading...
module.application.module.database.module.database.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.application.module.database.module.database.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=servian-production-20221124141200008100000001]
module.application.module.database.module.database.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.application.module.database.module.database.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.application.module.database.module.database.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=servian-production]
module.application.module.database.aws_ssm_parameter.database_host: Refreshing state... [id=/servian/production/DBHOST]
module.application.module.computing.aws_security_group.alb: Refreshing state... [id=sg-017dbd3db24352287]
module.application.module.computing.aws_cloudwatch_log_group.logs: Refreshing state... [id=/fargate/service/servian-production-fargate-log]
module.application.module.computing.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=servian-production-fargate-task-execution-role]
module.application.module.computing.module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:targetgroup/app-20221124142708187300000002/734236c918ddf89a]
module.application.module.computing.module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:293094141207:cluster/servian-production]
module.application.module.computing.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:loadbalancer/app/servian-production/4cf44224b829a8f5]
module.application.module.computing.aws_security_group.fargate: Refreshing state... [id=sg-0ae3cab39f196d56f]
module.application.module.computing.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment: Refreshing state... [id=servian-production-fargate-task-execution-role-20221124142708827500000003]
module.application.module.computing.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment_ssm: Refreshing state... [id=servian-production-fargate-task-execution-role-20221124142708863600000004]
module.application.module.computing.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment_ecr: Refreshing state... [id=servian-production-fargate-task-execution-role-20221124142708883100000005]
module.application.module.computing.aws_ecs_task_definition.web-app: Refreshing state... [id=servian-production]
module.application.module.computing.module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=servian-production]
module.application.module.computing.aws_ecs_service.web-app: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:293094141207:service/servian-production/servian-production]
module.application.module.computing.module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:listener/app/servian-production/4cf44224b829a8f5/1bac9b494cc1ca29]
module.application.module.computing.module.alb.aws_lb_listener.frontend_https[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:listener/app/servian-production/4cf44224b829a8f5/93dbd7cc9a184afd]
module.application.module.dns.aws_route53_record.www: Refreshing state... [id=Z05177202108NJJTHTNC6_www_CNAME]
module.application.module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z05177202108NJJTHTNC6_servian-prod.site_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.application.module.computing.data.aws_acm_certificate.certificate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_acm_certificate" "certificate" {
      + arn               = (known after apply)
      + certificate       = (known after apply)
      + certificate_chain = (known after apply)
      + domain            = "servian-dev.site"
      + id                = (known after apply)
      + most_recent       = true
      + status            = (known after apply)
      + tags              = (known after apply)
      + types             = [
          + "AMAZON_ISSUED",
        ]
    }

  # module.application.module.computing.data.aws_ssm_parameters_by_path.parameters will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameters_by_path" "parameters" {
      + arns   = (known after apply)
      + id     = (known after apply)
      + names  = (known after apply)
      + path   = "/servian/production/"
      + types  = (known after apply)
      + values = (sensitive value)
    }

  # module.application.module.computing.aws_ecs_service.web-app will be updated in-place
  ~ resource "aws_ecs_service" "web-app" {
        id                                 = "arn:aws:ecs:ap-southeast-2:293094141207:service/servian-production/servian-production"
        name                               = "servian-production"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-southeast-2:293094141207:task-definition/servian-production:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.application.module.computing.aws_ecs_task_definition.web-app must be replaced
-/+ resource "aws_ecs_task_definition" "web-app" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:293094141207:task-definition/servian-production:1" -> (known after apply)
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ container_definitions    = (sensitive) -> (known after apply) # forces replacement
      ~ id                       = "servian-production" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
      - task_role_arn            = "" -> null
        # (7 unchanged attributes hidden)
    }

  # module.application.module.dns.data.aws_route53_zone.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "this" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "servian-dev.site"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.application.module.dns.aws_route53_record.ipv4 must be replaced
-/+ resource "aws_route53_record" "ipv4" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "servian-prod.site" -> (known after apply)
      ~ id              = "Z05177202108NJJTHTNC6_servian-prod.site_A" -> (known after apply)
      ~ name            = "servian-prod.site" -> "servian-dev.site" # forces replacement
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z05177202108NJJTHTNC6" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.application.module.dns.aws_route53_record.www must be replaced
-/+ resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "www.servian-prod.site" -> (known after apply)
      ~ id              = "Z05177202108NJJTHTNC6_www_CNAME" -> (known after apply)
        name            = "www"
      ~ records         = [
          + "servian-dev.site",
          - "servian-prod.site",
        ]
      ~ zone_id         = "Z05177202108NJJTHTNC6" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.application.module.computing.module.alb.aws_lb_listener.frontend_https[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_https" {
      ~ certificate_arn   = "arn:aws:acm:ap-southeast-2:293094141207:certificate/2ea72b72-dd0c-4a64-8d1e-469b4990737c" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ap-southeast-2:293094141207:listener/app/servian-production/4cf44224b829a8f5/93dbd7cc9a184afd"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.application.module.database.module.database.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "servian-production"
        name                                  = "servian"
      ~ publicly_accessible                   = true -> false
        tags                                  = {}
        # (61 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workspace: `production`, Workflow: `Terraform Plan`*